In [1]:
import pandas as pd
from tabulate import tabulate

### Connect Pandas to the database with this URL:

In [2]:
# titles = pd.read_csv('data/titles.csv')
# titles.head()

In [3]:
# cast = pd.read_csv('data/cast.csv')
# cast.head()

In [4]:
cst_ab_pth = '/home/vanderscycle/Documents/Lighthouse-lab/Databases/w2-d2-db/imdb_pandas/cast.csv'
title_ab_pth = '/home/vanderscycle/Documents/Lighthouse-lab/Databases/w2-d2-db/imdb_pandas/titles.csv'


titles = pd.read_csv(title_ab_pth) # relative path use the forward slash
titles.head()

cast = pd.read_csv(cst_ab_pth)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
'''files_path
def open_rel(rel_path,files):
    for file in files:
   '''
# can I create a function to open multiple files?

'files_path\ndef open_rel(rel_path,files):\n    for file in files:\n   '

In [6]:
def pprint(df, headers=(), tablefmt='simple', floatfmt='g', numalign='decimal', stralign='left', missingval='', showindex='default', disable_numparse=False, colalign=None):

    #help(tabulate)
    return print(tabulate(df, headers=df.columns.values))

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [7]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [8]:
m_decade_range = range(1880,2030,10)
titles_range = titles.groupby(pd.cut(titles.year,m_decade_range)).count()
pprint(titles_range)

                title    year
------------  -------  ------
(1880, 1890]        0       0
(1890, 1900]        7       7
(1900, 1910]       55      55
(1910, 1920]     7617    7617
(1920, 1930]     8490    8490
(1930, 1940]    10277   10277
(1940, 1950]     8675    8675
(1950, 1960]    13113   13113
(1960, 1970]    18166   18166
(1970, 1980]    18351   18351
(1980, 1990]    20746   20746
(1990, 2000]    22672   22672
(2000, 2010]    42247   42247
(2010, 2020]    61847   61847

### Use groupby() count the number of "Hamlet" films made each decade.

In [9]:
m_decade_range = range(1880,2030,10)
ham = titles[titles['title'].isin(['Hamlet'])]
pprint(ham.groupby(pd.cut(ham.year,[1920,1930,1940,1950])).count()) # (most_accurate_df, range/list)

pprint(ham.groupby(pd.cut(ham.year,m_decade_range)).count())
#titles_range = titles.groupby(pd.cut(titles.year,m_decade_range)).count()
#pprint(titles_range)

                title    year
------------  -------  ------
(1920, 1930]        1       1
(1930, 1940]        0       0
(1940, 1950]        1       1
                title    year
------------  -------  ------
(1880, 1890]        0       0
(1890, 1900]        0       0
(1900, 1910]        1       1
(1910, 1920]        2       2
(1920, 1930]        1       1
(1930, 1940]        0       0
(1940, 1950]        1       1
(1950, 1960]        1       1
(1960, 1970]        2       2
(1970, 1980]        2       2
(1980, 1990]        2       2
(1990, 2000]        2       2
(2000, 2010]        1       1
(2010, 2020]        3       3

In [10]:
#help(pd.cut)

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [11]:
decade1950_range = range(1950,1959,1)
cast_50s_in = cast.set_index(['year','type','n']).sort_index(level=[0,1,2])

In [12]:
top_male_cast_50s = (cast_50s_in.loc[(decade1950_range,'actor',1)]).groupby(['year']).count()

In [13]:
top_female_cast_50s = (cast_50s_in.loc[(decade1950_range,'actress',1)]).groupby(['year']).count()

In [14]:
pd.unique(cast['type']) #cool methos to only see unique values in a given column(serie)

array(['actor', 'actress'], dtype=object)

In [15]:
delta_top_cast_roles = top_male_cast_50s-top_female_cast_50s
pprint(delta_top_cast_roles)

        title    name    character
----  -------  ------  -----------
1950      345     345          345
1951      366     366          366
1952      314     314          314
1953      351     351          351
1954      324     324          324
1955      360     360          360
1956      338     338          338
1957      434     434          434
1958      415     415          415

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [16]:
male_cast_n1to5 = dict()
for i in range(1,6):
    male_cast_n1to5[i]= cast_50s_in.loc[(decade1950_range,'actor',i)].groupby(['year'])

In [17]:
# for k,v in male_cast_n1to5.items():
#     print(f'\nmale role tier:{k}')
#     pprint(v.count())

In [18]:
female_cast_n1to5 = dict()
for i in range(1,6):
    female_cast_n1to5[i]= cast_50s_in.loc[(decade1950_range,'actress',i)].groupby(['year'])

In [19]:
# for k,v in male_cast_n1to5.items():
#     print(f'\nfemale role tier:{k}')
#     pprint(v.count())

In [20]:
#for (k,v), (k2,v2) in zip(d.items(), d2.items()):
for (km,vm),(kf,vf) in zip(male_cast_n1to5.items(),female_cast_n1to5.items()):
    delta_c = vm.count() - vf.count()
    print(f'\ndelta (male-female) for role tier:{km}\nnegative values means more female in that role')
    pprint(delta_c)

delta (male-female) for role tier:1
negative values means more female in that role
        title    name    character
----  -------  ------  -----------
1950      345     345          345
1951      366     366          366
1952      314     314          314
1953      351     351          351
1954      324     324          324
1955      360     360          360
1956      338     338          338
1957      434     434          434
1958      415     415          415

delta (male-female) for role tier:2
negative values means more female in that role
        title    name    character
----  -------  ------  -----------
1950       22      22           22
1951       26      26           26
1952        1       1            1
1953       12      12           12
1954      -63     -63          -63
1955      -34     -34          -34
1956       35      35           35
1957      -30     -30          -30
1958       16      16           16

delta (male-female) for role tier:3
negative values means more female in that role
        title    name    character
----  -------  ------  -----------
1950      191     191          191
1951      267     267          267
1952      233     233          233
1953      254     254          254
1954      267     267          267
1955      257     257          257
1956      244     244          244
1957      283     283          283
1958      249     249          249

delta (male-female) for role tier:4
negative values means more female in that role
        title    name    character
----  -------  ------  -----------
1950      263     263          263
1951      316     316          316
1952      240     240          240
1953      280     280          280
1954      292     292          292
1955      262     262          262
1956      255     255          255
1957      286     286          286
1958      268     268          268

delta (male-female) for role tier:5
negative values means more female in that role
        title    name    character
----  -------  ------  -----------
1950      331     331          331
1951      327     327          327
1952      316     316          316
1953      298     298          298
1954      279     279          279
1955      295     295          295
1956      290     290          290
1957      313     313          313
1958      308     308          308

In [21]:
top5_male_cast_50s = (cast_50s_in.loc[(decade1950_range,'actor',range(1,5))]).groupby(['year'])

In [22]:
top5_female_cast_50s = (cast_50s_in.loc[(decade1950_range,'actress',range(1,5))]).groupby(['year'])

In [23]:
delta_top5_cast_roles = top5_male_cast_50s.count()-top5_female_cast_50s.count()
#pprint(delta_top5_cast_roles)

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

[next time use the regex](https://kanoki.org/2019/11/12/how-to-use-regex-in-pandas/)

In [24]:
((cast[cast['title'].str.contains('Pink Panther')]).groupby('character')).head()

,title,year,name,type,character,n
955,The Pink Panther,2006,William Abadie,actor,Bizu,11.0
1978,Revenge of the Pink Panther,1978,Fredric Abbott,actor,Douvier's Soldier,38.0
4691,Curse of the Pink Panther,1983,William Abney,actor,Hugo the Houseman,33.0
12589,Son of the Pink Panther,1993,Tony Adams,actor,Wedding Guest,NaN
12590,The Return of the Pink Panther,1975,Tony Adams,actor,Waiter,NaN
...,...,...,...,...,...,...
3582494,Revenge of the Pink Panther,1978,Elisabeth Welch,actress,Mrs. Wu,24.0
3582965,The Pink Panther,1963,Meri Welles,actress,Monica Fawn,12.0
3584647,The Pink Panther,2006,Colleen Werthmann,actress,Jane,NaN
3606096,The Pink Panther,2006,Jadin Wong,actress,Granny,NaN
3616292,Revenge of the Pink Panther,1978,Rosita Yarboy,actress,Sam Spade and the Private Eyes,21.0

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [31]:
Fran_oz = cast[cast['name'].isin(['Frank Oz'])].groupby('year')

KeyError: 'Column not found: <pandas.core.groupby.generic.SeriesGroupBy object at 0x7f70b65f0370>'

### List each of the characters that Frank Oz has portrayed at least twice.